src/intepreter/amb.org
#+TITLE: amb求值器
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil 

* 定义
  _非确定计算_ 通过向解释器的求值模型中添加 *自动搜索* 功能来实现。例如： 
  #+BEGIN_SRC scheme
  (define (prime-sum-pair list1 list2)
    (let ((a (an-element-of list1))
	  (b (an-element-of list2)))
      (require (prime? (+ a b)))
      (list a b)))
  #+END_SRC

** 思想
   + 一个表达式可以有多个可能值。如 _an-element-of_ 可能返回作为其参数的表里的任何元素。求值这种表达式时，求值器自动选出一个值（可能是可以选的任一个值）并维持相关的轨迹：
     + 哪些元素选过
     + 哪些没选过
     + 保证不会重选
   + 如果后面的要求不满足，求值器会在有关的表里 *重新选择* ，直至求值成功；或者所有选择都已用完时 *求值失败* 

** 与流的比较
   + 流处理用 _惰性求值_ 来解耦潜在的流和流元素的实际产生时间之间的紧密联系，使得貌似整个流都存在，元素的产生没有时间顺序
   + 非确定性计算的表达式表示对 *一批可能世界的探索* ，每个世界由一串选择决定。求值器造成的假相： *时间能分叉* 。程序保存所有可能的执行历史，计算遇到死路时退回前面选择点转到另一分支

** amb求值器
   非确定性语言基于一种称为 *amb* 的特殊形式

   #+BEGIN_EXAMPLE 
     这个语言的名字和设计思想来自 John McCarthy。他还提出了＂人工智能＂这个词,被称为＂人工智能之父＂

     amb 的名字取自 ambiguous
   #+END_EXAMPLE

   在定义了前面非确定性过程后，将其送给 _amb_ 求值器，会看到:
   #+BEGIN_SRC scheme
  ;;; Amb-Eval input:
  (prime-sum-pair '(1 3 5 8) '(20 35 110))
  ;;; Starting a new problem
  ;;; Amb-Eval value:
  (3 20)
   #+END_SRC

   + 表达式求值时， _amb求值器_ 将从两个表里反复选择元素，直至做出一次成功选择
   + 如果需要，还可以要求它做进一步的选择，求出更多可能的值


*** amb形式
    我们的求值器中引入一种称为 _amb_ 的特殊形式：
    #+BEGIN_EXAMPLE
      (amb <e1> <e2> ... <en>)

      返回几个参数表达式之一的值
    #+END_EXAMPLE

    比如：
    #+BEGIN_SRC scheme
  (list (amb 1 2 3) (amb 'a 'b))
    #+END_SRC

    这个表达式可能返回下面任一结果：
    #+BEGIN_EXAMPLE
      (1 a), (1 b), (2 a), (2 b), (3 a), (3 b)
    #+END_EXAMPLE

    + 如果一个 _amb_ 表达式只有一个选择，就 *确定* 地返回该元素的值
    + 无选择的表达式 _(amb)_ 没有值，其求值导致 *计算失败且不产生值* 

    #+BEGIN_EXAMPLE
    可以认为 (amb) 用来表示 fail
    #+END_EXAMPLE

    由此可以用 _amb_ 来表示某个谓词 _p_ 必须为 _真_ ：
    #+BEGIN_SRC scheme 
  (define (require p)
    (if (not p) (amb)))
    #+END_SRC

    结合 _amb_ 和 _require_ 可以得到 an-element-of 过程：

    #+BEGIN_SRC scheme
  (define (an-element-of items)
    (require (not (null? items))) ;; 表为空是计算失败
    (amb (car items) (an-element-of (cdr items)))) ;; 反之，返回表中任何一个元素
    #+END_SRC

    也可以用来表达 *无穷选择* ，下面代码返回一个大于或等于给定 _n_ 的值：
    #+BEGIN_SRC scheme
  (define (an-integer-starting-from n)
    (amb n (an-integer-starting-from (+ n 1))))
    #+END_SRC

    #+BEGIN_EXAMPLE
    这个过程像是在构造一个流，但 amb 表达式只返回一个整数

    而流返回的是一个对象，这个对象表示所有大于或等于 n 的整数的序列 

    用户看到 amb 表达式返回一个选择，而流的实现则看到它能逐个地返回所有选择
    #+END_EXAMPLE
*** 搜索
    _amb_ 表达式导致计算进程分裂为多个分支：
    + 如果有多个处理器，可把它们分派到不同处理器，同时搜索
    + 只有一个处理器时每次选一个分支，保留其他选择权:
      + *随机* 选择，失败了退回重新选择
      + 按某种 *系统化* 的方式探查可能的分支。例如 _深度优先_ : 每次总选第一个尚未检查过的分支，失败时退回最近选择点．探查那里的下一个尚未探查过的分支
*** 驱动循环
    _amb_ 求值器读入表达式，输出 *第一个成功* 得到的值。允许人工要求回溯：输入 *try-again* ，求值器将设法找 *下一结果* ：

    #+BEGIN_SRC scheme
  ;;; Amb-Eval input:
  (prime-sum-pair '(1 3 5 8) '(20 35 110))
  ;;; Starting a new problem
  ;;; Amb-Eval value:
  (3 20)
  ;;; Amb-Eval input:
  try-again
  ;;; Amb-Eval value:
  (3 110)
  ;;; Amb-Eval input:
  try-again
  ;;; Amb-Eval value:
  (8 35)
  ;;; Amb-Eval input:
  try-again
  ;;; There are no more values of
  (prime-sum-pair (quote (1 3 5 8)) (quote (20 35 110)))
  ;;; Amb-Eval input:
  (prime-sum-pair '(19 27 30) '(11 36 58))
  ;;; Starting a new problem
  ;;; Amb-Eval value:
  (30 11)
    #+END_SRC

    遇到 _try-again_ 之外的其他表达式，都认为是重新开始一个新任务

