src/intepreter/amb.org
* 实现
  常规的 _Scheme_ 表达式可能：
  + 求出一个值
  + 不终止
  + 产生错误

  *非确定性* 的 _Scheme_ 表达式还可能：
  + 走入死胡同
  + 使求值过程 *回溯* 

  思路：
  + 基于 *分析求值器* 实现 amb 求值器
  + 不同点就在于它将 *生成不同的执行过程* 


** 基本设计

*** 续延
    *续延* ( _continuation_)是一种 *过程参数，将在过程的最后一步调用* ： 
    + 具有 _续延_ 参数的过程不准备返回，最后总调用某个 _续延_ 过程
    + 有 _尾递归优化_ 的语言可以处理这种续延参数，能够自动优化运行所需的空间

    #+BEGIN_EXAMPLE
      如果语言没有尾递归优化，栈空间就会越来越大

      例如:

      typedef int (*Fun) (int)

      int f (..., Fun p) { ...; p(...); return ...; }

      从 f 实际返回前都不会释放 f 占用的栈空间
    #+END_EXAMPLE

*** 执行过程
    在常规 Scheme 语言的分析求值器里， _eval_ 生成的执行过程要求一个 _环境_ 参数，而 _amb_ 分析器产生的执行过程要求三个参数:
    1. 一个 _环境_
    2. 一个 _成功续延_ 
    3. 一个 _失败续延_ 

    _amb_ 表达式求值结束时总调用这两个过程之一：
    + 如果求值正常并得到结果，就调用 *成功续延* 
    + 如果求值进入死胡同，就调用 *失败续延* 

**** 回溯
     求值过程中的实际 _回溯_ 是通过 *构造适当的成功续延和失败续延* 实现的：
     + _成功续延_ （过程）：将 *得到一个值（参数）并将计算进行下去* 
       + 它还得到一个 _失败续延_
       + 如果用得到的值做计算将来遇到死胡同，就会调用该 _失败续延_ 
     + _失败续延_ （过程）的作用是 *探查另一个非确定性分支* ：
       + 在遇到无法确定取哪个值能得到最后结果时先取一个值
       + 同时构造一个失败续延，并将它们一起送给成功续延过程，以便将来遇到失败时回溯
       + 求值无法进行时（如遇到 _require_ 失败时）：
	 + 调用当时的失败续延，使执行回到前一选择点去考虑其他分支
	 + 如果前一选择点已无更多选择，执行就会回到更前面的选择点（那里保存有以前的失败续延）
       + _try-again_ 导致驱动循环直接调用 *当时的失败续延*
       + 如果被选分支做了有副作用的操作（例如 _变量赋值_ ），后来遇到死胡同回溯时，需要在进入其他选择前 *撤销该副作用* ：
	 + 处理方法：让 _产生副作用的操作生成一个能撤销副作用的失败续延过程_ ，该过程撤销所做修改之后再回溯到前面选择点

*** 总结
    #+BEGIN_EXAMPLE
      失败续延（过程）的构造，几种情况:
      1. amb 表达式：提供一种机制，使当前选择失败时可以换一个选择
      2. 最高层驱动循环：在用尽了所有选择的情况下报告失败
      3. 赋值：拦截出现的失败并在回溯前消除赋值的效果
    #+END_EXAMPLE

    #+BEGIN_EXAMPLE
      失败的原因是求值遇到死胡同，两种情况下出现：
      1. 用户程序执行 (amb) 时
      2. 用户输入 try-again 时
    #+END_EXAMPLE

    #+BEGIN_EXAMPLE
      一个执行过程失败，它就调用自己的失败继续：

      由赋值构造出的失败续延先消除自己的副作用．然后调用该赋值拦截的那个失败续延，将失败进一步回传

      如果某 amb 的失败续延发现所有选择已用完时，就调用这个 amb 早先得到的那个失败续延，把失败传到更早的选择点
    #+END_EXAMPLE
** 程序结构
   _amb_ 求值器的 *语法过程* 和 *数据结构* 表示、基本的 _analyze_ 过程都与分析求值器一样。只需增加识别 _amb_ 表达式的语法过程：

   #+BEGIN_SRC scheme 
  (define (amb? exp) (tagged-list? exp 'amb))
  ;; (amb? '(amb 1 2 3)) ; => #t 
  ;; (amb? #t) ; => #f 
  ;; (amb? 1) ; => #f
   #+END_SRC

   #+BEGIN_SRC scheme
  (define (amb-choices exp) (cdr exp))
  ;; (amb-choices '(amb 1 2 3)) ; => (1 2 3)
   #+END_SRC

   在 _analyze_ 里增加处理 _amb_ 表达式的分支：
   #+BEGIN_SRC scheme
  ((amb? exp) (analyze-amb exp))
   #+END_SRC

   最高层的 _ambeval_ 分析给定的表达式，应用得到的执行过程:
   #+BEGIN_SRC scheme
  (define (ambeval exp env succeed fail)
    ((analyze exp) env succeed fail)) 
   #+END_SRC

   _成功续延_ 过程都有两个参数：
   + 一个值参数
   + 一个失败续延

   _失败续延_ ：无参过程

   因此执行过程的形式都是三个参数：
   #+BEGIN_SRC scheme
  (lambda (env succeed fail)
    ;; succeed is (lambda (value fail) ...)
    ;; fail is (lambda () ...)
    ;;...)
   #+END_SRC

   在最上层的 _ambeval_ 调用：
   #+BEGIN_SRC scheme
  (ambeval <exp>
	   the-global-environment
	   (lambda (value fail) value) ;; 直接返回 value 
	   (lambda () 'failed)) ;; 返回 'failed

  ;; (define (my-succeed value fail) value) 
  ;; (define (my-fail) 'failed) 
  ;; (my-succeed 1 my-fail) ; => 1
  ;; (my-fail) ; => failed
   #+END_SRC

   执行求值 _<exp>_ ，最后可能返回求出的值(如果得到值),或返回符号 _failed_ 表示求值失败
   #+BEGIN_EXAMPLE
     后面实现的驱动循环里用了一个更复杂的续延过程，以便能支持用户输入的 try-again 请求
   #+END_EXAMPLE

** 续延过程
   _amb_ 求值器实现中，最复杂的东西就是 *续延过程的构造和传递* 


