src/intepreter/amb.org
*** 简单表达式
    简单表达式的分析和前面一样。这些表达式的 *求值总成功* ，所以都 *调用自己的成功续延* ，但都 *需要传递 fail 续延过程* 

    _自求值_ 表达式：
    #+BEGIN_SRC scheme
  (define (analyze-self-evaluating exp)
    (lambda (env succeed fail) ;; succeed 过程有 2 个参数，第一个是返回值，第二个是失败续延．而 fail 过程没有参数
      (succeed exp fail))) ;; 直接返回 exp, 把当前的失败续延传递进去

  ;; ((analyze-self-evaluating 1)
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => 1 

  ;; ((analyze-self-evaluating "hello")
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => "hello"
    #+END_SRC

    _引用_ 表达式：
    #+BEGIN_SRC scheme
  (define (analyze-quoted exp)
    (let ((qval (text-of-quotation exp)))
      (lambda (env succeed fail)
	(succeed qval fail))))

  ;; ((analyze-quoted '(quote abc))
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => abc
    #+END_SRC

    _变量_ 表达式：
    #+BEGIN_SRC scheme
  (define (analyze-variable exp)
    (lambda (env succeed fail)
      (succeed (lookup-variable-value exp env)
	       fail)))

  ;; (define test-extend-dev (extend-environment '(a b) '(300 400) '())) ; => test-extend-dev

  ;; ((analyze-variable 'a)
  ;;  test-extend-dev
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed))  ; => 300   

  ;; ((analyze-variable 'b)
  ;;  test-extend-dev
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => 400

  ;; ((analyze-variable 'c)
  ;;  test-extend-dev
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => ;Unbound variable c
    #+END_SRC

    #+BEGIN_EXAMPLE
      注意：查找变量的值可能出错，但程序错误并不导致回溯和重新选择
    #+END_EXAMPLE

    _lambda_ 表达式：
    #+BEGIN_SRC scheme
  (define (analyze-lambda exp)
    (let ((vars (lambda-parameters exp))
	  (bproc (analyze-sequence (lambda-body exp))))
      (lambda (env succeed fail)
	(succeed (make-procedure vars bproc env)
		 fail))))

  ;; ((analyze-lambda '(lambda (x) (+ 1 x))) 
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; =>  (procedure (x) #[compound-procedure 14] ())
    #+END_SRC

