src/intepreter/amb.org
*** 条件表达式
    #+BEGIN_SRC scheme
  (define (analyze-if exp)
    (let ((pproc (analyze (if-predicate exp)))
	  (cproc (analyze (if-consequent exp)))
	  (aproc (analyze (if-alternative exp))))
      (lambda (env succeed fail)
	(pproc env
	       ;; pproc 过程的成功续延
	       ;; 如果 pproc 过程执行成功，会把计算出的真假值传递给pred-value，以及当前的 fail 传递给 fail2
	       (lambda (pred-value fail2)  
		 (if (true? pred-value)
		     (cproc env succeed fail2)
		     (aproc env succeed fail2)))
	       ;; pproc 过程的失败续延，就是 if 过程的失败续延
	       fail))))

  ;; (define my-succeed (lambda (value fail) value))
  ;; (define my-fail (lambda () 'failed))
  ;; (define test-environment (setup-environment))

  ;; (define if-proc (analyze-if '(if true 100 200)))
  ;; (if-proc test-environment my-succeed my-fail) ; => 100

  ;; (define if-pproc (analyze 'true))
  ;; (define if-cproc (analyze 100))
  ;; (define if-aproc (analyze 200))

  ;; (if-pproc test-environment
  ;; 	  (lambda (pred-value fail2) 
  ;;                (if (true? pred-value)
  ;;                    (if-cproc test-environment my-succeed fail2)
  ;;                    (if-aproc test-environment my-succeed fail2)))
  ;;              my-fail) ;=> 100

  ;; ((analyze-variable 'true) test-environment
  ;; 	  (lambda (pred-value fail2) 
  ;;                (if (true? pred-value)
  ;;                    (if-cproc test-environment my-succeed fail2)
  ;;                    (if-aproc test-environment my-succeed fail2)))
  ;;              my-fail) ; => 100

  ;; (define if-pproc-succeed
  ;;   (lambda (pred-value fail2) 
  ;;                (if (true? pred-value)
  ;;                    (if-cproc test-environment my-succeed fail2)
  ;;                    (if-aproc test-environment my-succeed fail2))))

  ;; (if-pproc-succeed
  ;;  (lookup-variable-value 'true test-environment)
  ;;  my-fail) ; => 100

  ;; (if (true? (lookup-variable-value 'true test-environment))
  ;;     (if-cproc test-environment my-succeed my-fail)
  ;;     (if-aproc test-environment my-succeed my-fail)) ; => 100
    #+END_SRC

    生成的执行过程调用由产生的谓词执行过程 _pproc_ : 
    + _pproc_ 的成功续延检查谓词的值，根据其真假调用 _cproc_ 或 _aproc_
    + _pproc_ 执行失败时调用 _if_ 表达式的失败续延过程 _fail_ 

