html/intepreter/amb.html

<div id="outline-container-org4e0bde4" class="outline-4">
<h4 id="org4e0bde4">条件表达式</h4>
<div class="outline-text-4" id="text-org4e0bde4">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-if</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>pproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>if-predicate exp<span style="color: #696969;">)))</span>
        <span style="color: #696969;">(</span>cproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>if-consequent exp<span style="color: #696969;">)))</span>
        <span style="color: #696969;">(</span>aproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>if-alternative exp<span style="color: #696969;">))))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>pproc env
             <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">pproc &#36807;&#31243;&#30340;&#25104;&#21151;&#32493;&#24310;</span>
             <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#22914;&#26524; pproc &#36807;&#31243;&#25191;&#34892;&#25104;&#21151;&#65292;&#20250;&#25226;&#35745;&#31639;&#20986;&#30340;&#30495;&#20551;&#20540;&#20256;&#36882;&#32473;pred-value&#65292;&#20197;&#21450;&#24403;&#21069;&#30340; fail &#20256;&#36882;&#32473; fail2</span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>pred-value fail2<span style="color: #696969;">)</span>  
               <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>true? pred-value<span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>cproc env succeed fail2<span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>aproc env succeed fail2<span style="color: #696969;">)))</span>
             <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">pproc &#36807;&#31243;&#30340;&#22833;&#36133;&#32493;&#24310;&#65292;&#23601;&#26159; if &#36807;&#31243;&#30340;&#22833;&#36133;&#32493;&#24310;</span>
             fail<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-succeed (lambda (value fail) value))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-fail (lambda () 'failed))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define test-environment (setup-environment))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define if-proc (analyze-if '(if true 100 200)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(if-proc test-environment my-succeed my-fail) ; =&gt; 100</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define if-pproc (analyze 'true))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define if-cproc (analyze 100))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define if-aproc (analyze 200))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(if-pproc test-environment</span>
<span style="color: #5f9ea0; font-style: italic;">;;        </span><span style="color: #5f9ea0; font-style: italic;">(lambda (pred-value fail2) </span>
<span style="color: #5f9ea0; font-style: italic;">;;                </span><span style="color: #5f9ea0; font-style: italic;">(if (true? pred-value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">(if-cproc test-environment my-succeed fail2)</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">(if-aproc test-environment my-succeed fail2)))</span>
<span style="color: #5f9ea0; font-style: italic;">;;              </span><span style="color: #5f9ea0; font-style: italic;">my-fail) ;=&gt; 100</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-variable 'true) test-environment</span>
<span style="color: #5f9ea0; font-style: italic;">;;        </span><span style="color: #5f9ea0; font-style: italic;">(lambda (pred-value fail2) </span>
<span style="color: #5f9ea0; font-style: italic;">;;                </span><span style="color: #5f9ea0; font-style: italic;">(if (true? pred-value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">(if-cproc test-environment my-succeed fail2)</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">(if-aproc test-environment my-succeed fail2)))</span>
<span style="color: #5f9ea0; font-style: italic;">;;              </span><span style="color: #5f9ea0; font-style: italic;">my-fail) ; =&gt; 100</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define if-pproc-succeed</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(lambda (pred-value fail2) </span>
<span style="color: #5f9ea0; font-style: italic;">;;                </span><span style="color: #5f9ea0; font-style: italic;">(if (true? pred-value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">(if-cproc test-environment my-succeed fail2)</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">(if-aproc test-environment my-succeed fail2))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(if-pproc-succeed</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lookup-variable-value 'true test-environment)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">my-fail) ; =&gt; 100</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(if (true? (lookup-variable-value 'true test-environment))</span>
<span style="color: #5f9ea0; font-style: italic;">;;     </span><span style="color: #5f9ea0; font-style: italic;">(if-cproc test-environment my-succeed my-fail)</span>
<span style="color: #5f9ea0; font-style: italic;">;;     </span><span style="color: #5f9ea0; font-style: italic;">(if-aproc test-environment my-succeed my-fail)) ; =&gt; 100</span>
</pre>
</div>

<p>
生成的执行过程调用由产生的谓词执行过程 <span class="underline">pproc</span> : 
</p>
<ul class="org-ul">
<li><span class="underline">pproc</span> 的成功续延检查谓词的值，根据其真假调用 <span class="underline">cproc</span> 或 <span class="underline">aproc</span></li>
<li><span class="underline">pproc</span> 执行失败时调用 <span class="underline">if</span> 表达式的失败续延过程 <span class="underline">fail</span></li>
</ul>
</div>
</div>
