src/intepreter/amb.org
*** 顺序表达式
    顺序执行两个表达式 _a_ 和 _b_ ，实际上是在 _a_ 的成功续延中执行 _b_ ： 
    #+BEGIN_SRC scheme
  (define (analyze-sequence exps)
    (define (sequentially a b)
      (lambda (env succeed fail)
	(a env
	   ;; a 过程的成功续延，如果 a 过程成功执行，计算的结果作为 a-value 传递进下面的成功续延，
	   (lambda (a-value fail2) ;; a-value 被舍弃，下面不会用到
	     (b env succeed fail2)) ;; 继续执行 b 过程
	   ;; a 过程的失败续延，调用传递进来的失败续延
	   fail)))
    (define (loop first-proc rest-procs)
      (if (null? rest-procs)
	  first-proc
	  (loop (sequentially first-proc (car rest-procs))
		(cdr rest-procs))))
    (let ((procs (map analyze exps)))
      (if (null? procs)
	  (error "Empty sequence -- ANALYZE"))
      (loop (car procs) (cdr procs))))　

  ;; (define my-succeed (lambda (value fail) value))
  ;; (define my-fail (lambda () 'failed))
  ;; (define test-environment (setup-environment))

  ;; (define sequence-proc (analyze-sequence '(100 true "hello")))
  ;; (sequence-proc test-environment my-succeed my-fail) ; => "hello"
    #+END_SRC

*** 定义表达式
    调用值表达式的执行过程 _vproc_ ，以 _当时环境_ 、 _完成实际定义的成功续延_ 和 _调用时的失败续延 fail_ 为参数：
    #+BEGIN_SRC scheme
  (define (analyze-definition exp)
    (let ((var (definition-variable exp))
	  (vproc (analyze (definition-value exp)))) 
      (lambda (env succeed fail)
	(vproc env ; 当时的环境                       
	       (lambda (val fail2)
		 (define-variable! var val env) ; 在 vproc 的成功续延里完成在环境中变量的定义
		 (succeed 'ok fail2))
	       fail))))

  ;; (define my-succeed (lambda (value fail) value))
  ;; (define my-fail (lambda () 'failed))
  ;; (define test-environment (setup-environment))

  ;; ((analyze-definition '(define a (quote hello))) test-environment my-succeed my-fail) ; => ok
  ;; test-environment 
  ;; => (((a false true car cdr cons null? + >)
  ;;      hello
  ;;      #f
  ;;      #t
  ;;      (primitive #[compiled-procedure 17 ("list" #x1) #x1a #x1fc23e2])
  ;;      (primitive #[compiled-procedure 18 ("list" #x2) #x1a #x1fc2452])
  ;;      (primitive #[compiled-procedure 19 ("list" #x3) #x14 #x1fc24bc])
  ;;      (primitive #[compiled-procedure 20 ("list" #x5) #x14 #x1fc255c])
  ;;      (primitive #[arity-dispatched-procedure 21])
  ;;      (primitive #[arity-dispatched-procedure 22])))
    #+END_SRC

    _vproc_ 的成功续延完成 *实际的变量定义* 并成功返回 

    #+BEGIN_EXAMPLE
      这里没有考虑覆盖原有定义可能需要回滚
    #+END_EXAMPLE

