html/intepreter/amb.html

<div id="outline-container-org018b316" class="outline-4">
<h4 id="org018b316">顺序表达式</h4>
<div class="outline-text-4" id="text-org018b316">
<p>
顺序执行两个表达式 <span class="underline">a</span> 和 <span class="underline">b</span> ，实际上是在 <span class="underline">a</span> 的成功续延中执行 <span class="underline">b</span> ： 
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-sequence</span> exps<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">sequentially</span> a b<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>a env
         <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a &#36807;&#31243;&#30340;&#25104;&#21151;&#32493;&#24310;&#65292;&#22914;&#26524; a &#36807;&#31243;&#25104;&#21151;&#25191;&#34892;&#65292;&#35745;&#31639;&#30340;&#32467;&#26524;&#20316;&#20026; a-value &#20256;&#36882;&#36827;&#19979;&#38754;&#30340;&#25104;&#21151;&#32493;&#24310;&#65292;</span>
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>a-value fail2<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a-value &#34987;&#33293;&#24323;&#65292;&#19979;&#38754;&#19981;&#20250;&#29992;&#21040;</span>
           <span style="color: #696969;">(</span>b env succeed fail2<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#32487;&#32493;&#25191;&#34892; b &#36807;&#31243;</span>
         <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a &#36807;&#31243;&#30340;&#22833;&#36133;&#32493;&#24310;&#65292;&#35843;&#29992;&#20256;&#36882;&#36827;&#26469;&#30340;&#22833;&#36133;&#32493;&#24310;</span>
         fail<span style="color: #696969;">)))</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">loop</span> first-proc rest-procs<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? rest-procs<span style="color: #696969;">)</span>
        first-proc
        <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>sequentially first-proc <span style="color: #696969;">(</span>car rest-procs<span style="color: #696969;">))</span>
              <span style="color: #696969;">(</span>cdr rest-procs<span style="color: #696969;">))))</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>procs <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">map</span> analyze exps<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? procs<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>error <span style="color: #deb887;">"Empty sequence -- ANALYZE"</span><span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>car procs<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>cdr procs<span style="color: #696969;">))))</span>&#12288;

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-succeed (lambda (value fail) value))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-fail (lambda () 'failed))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define test-environment (setup-environment))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define sequence-proc (analyze-sequence '(100 true "hello")))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(sequence-proc test-environment my-succeed my-fail) ; =&gt; "hello"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org28421ae" class="outline-4">
<h4 id="org28421ae">定义表达式</h4>
<div class="outline-text-4" id="text-org28421ae">
<p>
调用值表达式的执行过程 <span class="underline">vproc</span> ，以 <span class="underline">当时环境</span> 、 <span class="underline">完成实际定义的成功续延</span> 和 <span class="underline">调用时的失败续延 fail</span> 为参数：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-definition</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>var <span style="color: #696969;">(</span>definition-variable exp<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>vproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>definition-value exp<span style="color: #696969;">))))</span> 
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>vproc env <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#24403;&#26102;&#30340;&#29615;&#22659;                       </span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>val fail2<span style="color: #696969;">)</span>
               <span style="color: #696969;">(</span>define-variable! var val env<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#22312; vproc &#30340;&#25104;&#21151;&#32493;&#24310;&#37324;&#23436;&#25104;&#22312;&#29615;&#22659;&#20013;&#21464;&#37327;&#30340;&#23450;&#20041;</span>
               <span style="color: #696969;">(</span>succeed 'ok fail2<span style="color: #696969;">))</span>
             fail<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-succeed (lambda (value fail) value))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-fail (lambda () 'failed))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define test-environment (setup-environment))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-definition '(define a (quote hello))) test-environment my-succeed my-fail) ; =&gt; ok</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">test-environment </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (((a false true car cdr cons null? + &gt;)</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">hello</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">#f</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">#t</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 17 ("list" #x1) #x1a #x1fc23e2])</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 18 ("list" #x2) #x1a #x1fc2452])</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 19 ("list" #x3) #x14 #x1fc24bc])</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 20 ("list" #x5) #x14 #x1fc255c])</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[arity-dispatched-procedure 21])</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[arity-dispatched-procedure 22])))</span>
</pre>
</div>

<p>
<span class="underline">vproc</span> 的成功续延完成 <b>实际的变量定义</b> 并成功返回 
</p>

<pre class="example">
      这里没有考虑覆盖原有定义可能需要回滚
</pre>
</div>
</div>
