src/intepreter/amb.org
*** 赋值表达式
    赋值的情况更复杂。其前一部分与处理定义类似，先做值表达式的执行过程，其失败也是整个赋值表达式失败

    值表达式求值成功后。为了让将来失败时可以 *撤销赋值* 效果，在 _求值表达式的成功续延_ ( _*1_ )把原变量值保存在 _old-value_ 后再赋值，并把恢复值的动作插入它传给 _赋值的成功续延_  中的 _失败续延_ 里( _*2_ )，该失败续延过程最后调用 _fail2_ ，来把失败返回给最初的失败续延

    #+BEGIN_SRC scheme
  (define (analyze-assignment exp)
    (let ((var (assignment-variable exp))
	  (vproc (analyze (assignment-value exp))))
      (lambda (env succeed fail)
	(vproc env
	       (lambda (val fail2)        ; *1* 求值表达式的成功续延，先保存变量的原始值，再赋值，赋值完成后，调用传入的 succeed 续延
		 (let ((old-value
			(lookup-variable-value var env))) 
		   (set-variable-value! var val env)
		   (succeed 'ok
			    (lambda ()    ; *2*
			      (set-variable-value! var
						   old-value
						   env) ; 一旦 succeed 失败，将恢复变量原始值，再调用最初的失败续延
			      (fail2)))))
	       fail))))

  ;; (define my-succeed (lambda (value fail) value))
  ;; (define my-fail (lambda () 'failed))
  ;; (define test-environment (setup-environment)) 
  ;; ((analyze-definition '(define a (quote hello))) test-environment my-succeed my-fail) ; => ok

  ;; ((analyze-assignment '(set! a (quote world))) test-environment my-succeed my-fail)  ;=> ok
  ;; test-environment
  ;; =>  (((a false true car cdr cons null? + >)
  ;;       world
  ;;       #f
  ;;       #t
  ;;       (primitive #[compiled-procedure 17 ("list" #x1) #x1a #x1fc23e2])
  ;;       (primitive #[compiled-procedure 18 ("list" #x2) #x1a #x1fc2452])
  ;;       (primitive #[compiled-procedure 19 ("list" #x3) #x14 #x1fc24bc])
  ;;       (primitive #[compiled-procedure 20 ("list" #x5) #x14 #x1fc255c])
  ;;       (primitive #[arity-dispatched-procedure 21])
  ;;       (primitive #[arity-dispatched-procedure 22])))
    #+END_SRC

