html/intepreter/amb.html

<div id="outline-container-org52e9bde" class="outline-4">
<h4 id="org52e9bde">赋值表达式</h4>
<div class="outline-text-4" id="text-org52e9bde">
<p>
赋值的情况更复杂。其前一部分与处理定义类似，先做值表达式的执行过程，其失败也是整个赋值表达式失败
</p>

<p>
值表达式求值成功后。为了让将来失败时可以 <b>撤销赋值</b> 效果，在 <span class="underline">求值表达式的成功续延</span> ( <span class="underline">*1</span> )把原变量值保存在 <span class="underline">old-value</span> 后再赋值，并把恢复值的动作插入它传给 <span class="underline">赋值的成功续延</span>  中的 <span class="underline">失败续延</span> 里( <span class="underline">*2</span> )，该失败续延过程最后调用 <span class="underline">fail2</span> ，来把失败返回给最初的失败续延
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-assignment</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>var <span style="color: #696969;">(</span>assignment-variable exp<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>vproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>assignment-value exp<span style="color: #696969;">))))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>vproc env
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>val fail2<span style="color: #696969;">)</span>        <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">*1* &#27714;&#20540;&#34920;&#36798;&#24335;&#30340;&#25104;&#21151;&#32493;&#24310;&#65292;&#20808;&#20445;&#23384;&#21464;&#37327;&#30340;&#21407;&#22987;&#20540;&#65292;&#20877;&#36171;&#20540;&#65292;&#36171;&#20540;&#23436;&#25104;&#21518;&#65292;&#35843;&#29992;&#20256;&#20837;&#30340; succeed &#32493;&#24310;</span>
               <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>old-value
                      <span style="color: #696969;">(</span>lookup-variable-value var env<span style="color: #696969;">)))</span> 
                 <span style="color: #696969;">(</span>set-variable-value! var val env<span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span>succeed 'ok
                          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>    <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">*2*</span>
                            <span style="color: #696969;">(</span>set-variable-value! var
                                                 old-value
                                                 env<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#19968;&#26086; succeed &#22833;&#36133;&#65292;&#23558;&#24674;&#22797;&#21464;&#37327;&#21407;&#22987;&#20540;&#65292;&#20877;&#35843;&#29992;&#26368;&#21021;&#30340;&#22833;&#36133;&#32493;&#24310;</span>
                            <span style="color: #696969;">(</span>fail2<span style="color: #696969;">)))))</span>
             fail<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-succeed (lambda (value fail) value))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define my-fail (lambda () 'failed))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define test-environment (setup-environment)) </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-definition '(define a (quote hello))) test-environment my-succeed my-fail) ; =&gt; ok</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-assignment '(set! a (quote world))) test-environment my-succeed my-fail)  ;=&gt; ok</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">test-environment</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt;  (((a false true car cdr cons null? + &gt;)</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">world</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">#f</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">#t</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 17 ("list" #x1) #x1a #x1fc23e2])</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 18 ("list" #x2) #x1a #x1fc2452])</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 19 ("list" #x3) #x14 #x1fc24bc])</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[compiled-procedure 20 ("list" #x5) #x14 #x1fc255c])</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[arity-dispatched-procedure 21])</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">(primitive #[arity-dispatched-procedure 22])))</span>
</pre>
</div>
</div>
</div>
