src/intepreter/amb.org
*** 过程表达式
    过程表达式的复杂性来自于 *依次计算每个实参的时候，每一步都需要维护成功和失败续延的轨迹* 。因此需要提供一个新的 _get-args_ 函数来替代原来的 _map_ 过程：
    #+BEGIN_SRC scheme
  (define (analyze-application exp)
    (let ((fproc (analyze (operator exp)))
	  (aprocs (map analyze (operands exp))))
      (lambda (env succeed fail)
	(fproc env
	       (lambda (proc fail2) ; fproc 的成功续延：依次计算每个实参
		 (get-args aprocs
			   env
			   (lambda (args fail3) ; get-args 的成功续延：所有参数都成功计算完毕后，做实际的过程调用
			     (execute-application
			      proc args succeed fail3))
			   fail2))
	       fail)))) 
    #+END_SRC

    _get-args_ : 顺序执行各运算对象的执行过程

    #+BEGIN_SRC scheme
  (define (get-args aprocs env succeed fail)
    (if (null? aprocs)
	(succeed '() fail)
	((car aprocs) env ;  "求值第一个运算参数" 的执行过程
	 (lambda (arg fail2) ; (car aprocs) 的成功续延
	   (get-args (cdr aprocs) ; 对余下参数进行求值
		     env
		     (lambda (args fail3) ; (get-args (cdr aprocs)) 的成功续延
		       (succeed (cons arg args) ; 用 cons 来收集所有的求值结果，然后把他送给最初调用的成功续延
				fail3))
		     fail2))
	 fail)))
    #+END_SRC

    _execute-application_ : 执行实际的过程调用

    #+BEGIN_SRC scheme
  (define (execute-application proc args succeed fail)
    (cond ((primitive-procedure? proc)
	   (succeed (apply-primitive-procedure proc args)
		    fail))
	  ((compound-procedure? proc)
	   ((procedure-body proc)
	    (extend-environment (procedure-parameters proc)
				args
				(procedure-environment proc))
	    succeed
	    fail))
	  (else
	   (error
	    "Unknown procedure type -- EXECUTE-APPLICATION"
	    proc))))
    #+END_SRC

    这个过程较长，实际上和 _简单表达式_ 处理一样

*** amb表达式
    _amb_ 的 _执行过程_ 定义了一个循环 try-next，它周而复始地去做针对表达式所有可能值的执行过程：
    + 对于每个执行过程的调用，都带有一个 _失败续延_ ，这个失败续延会 *导致去试探下一个可能值* 
    + 如果不再存在可能值时候，整个 _amb_ 表达式失败

    #+BEGIN_SRC scheme
  (define (analyze-amb exp)
    (let ((cprocs (map analyze (amb-choices exp)))) ; 分析各子表达式的执行过程
      (lambda (env succeed fail) 
	(define (try-next choices) 
	  (if (null? choices)
	      (fail) ; 没有任何值可以试探的时候，报出失败
	      ((car choices) env ; 调用 "第一个可能值" 的执行过程
	       succeed ; (car choices) 成功续延：原始的成功续延，实际上就是 amb 执行成功
	       (lambda () ; (car choices) 失败续延：尝试下一个可能值
		 (try-next (cdr choices))))))
	(try-next cprocs))))
    #+END_SRC

