html/intepreter/amb.html

<div id="outline-container-org5e9846f" class="outline-4">
<h4 id="org5e9846f">过程表达式</h4>
<div class="outline-text-4" id="text-org5e9846f">
<p>
过程表达式的复杂性来自于 <b>依次计算每个实参的时候，每一步都需要维护成功和失败续延的轨迹</b> 。因此需要提供一个新的 <span class="underline">get-args</span> 函数来替代原来的 <span class="underline">map</span> 过程：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-application</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>fproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>operator exp<span style="color: #696969;">)))</span>
        <span style="color: #696969;">(</span>aprocs <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">map</span> analyze <span style="color: #696969;">(</span>operands exp<span style="color: #696969;">))))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>fproc env
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>proc fail2<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fproc &#30340;&#25104;&#21151;&#32493;&#24310;&#65306;&#20381;&#27425;&#35745;&#31639;&#27599;&#20010;&#23454;&#21442;</span>
               <span style="color: #696969;">(</span>get-args aprocs
                         env
                         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>args fail3<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">get-args &#30340;&#25104;&#21151;&#32493;&#24310;&#65306;&#25152;&#26377;&#21442;&#25968;&#37117;&#25104;&#21151;&#35745;&#31639;&#23436;&#27605;&#21518;&#65292;&#20570;&#23454;&#38469;&#30340;&#36807;&#31243;&#35843;&#29992;</span>
                           <span style="color: #696969;">(</span>execute-application
                            proc args succeed fail3<span style="color: #696969;">))</span>
                         fail2<span style="color: #696969;">))</span>
             fail<span style="color: #696969;">))))</span> 
</pre>
</div>

<p>
<span class="underline">get-args</span> : 顺序执行各运算对象的执行过程
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">get-args</span> aprocs env succeed fail<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? aprocs<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>succeed '<span style="color: #696969;">()</span> fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">((</span>car aprocs<span style="color: #696969;">)</span> env <span style="color: #5f9ea0; font-style: italic;">;  </span><span style="color: #5f9ea0; font-style: italic;">"&#27714;&#20540;&#31532;&#19968;&#20010;&#36816;&#31639;&#21442;&#25968;" &#30340;&#25191;&#34892;&#36807;&#31243;</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg fail2<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">(car aprocs) &#30340;&#25104;&#21151;&#32493;&#24310;</span>
         <span style="color: #696969;">(</span>get-args <span style="color: #696969;">(</span>cdr aprocs<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#23545;&#20313;&#19979;&#21442;&#25968;&#36827;&#34892;&#27714;&#20540;</span>
                   env
                   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>args fail3<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">(get-args (cdr aprocs)) &#30340;&#25104;&#21151;&#32493;&#24310;</span>
                     <span style="color: #696969;">(</span>succeed <span style="color: #696969;">(</span>cons arg args<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#29992; cons &#26469;&#25910;&#38598;&#25152;&#26377;&#30340;&#27714;&#20540;&#32467;&#26524;&#65292;&#28982;&#21518;&#25226;&#20182;&#36865;&#32473;&#26368;&#21021;&#35843;&#29992;&#30340;&#25104;&#21151;&#32493;&#24310;</span>
                              fail3<span style="color: #696969;">))</span>
                   fail2<span style="color: #696969;">))</span>
       fail<span style="color: #696969;">)))</span>
</pre>
</div>

<p>
<span class="underline">execute-application</span> : 执行实际的过程调用
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">execute-application</span> proc args succeed fail<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>primitive-procedure? proc<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span>succeed <span style="color: #696969;">(</span>apply-primitive-procedure proc args<span style="color: #696969;">)</span>
                  fail<span style="color: #696969;">))</span>
        <span style="color: #696969;">((</span>compound-procedure? proc<span style="color: #696969;">)</span>
         <span style="color: #696969;">((</span>procedure-body proc<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span>extend-environment <span style="color: #696969;">(</span>procedure-parameters proc<span style="color: #696969;">)</span>
                              args
                              <span style="color: #696969;">(</span>procedure-environment proc<span style="color: #696969;">))</span>
          succeed
          fail<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span>
         <span style="color: #696969;">(</span>error
          <span style="color: #deb887;">"Unknown procedure type -- EXECUTE-APPLICATION"</span>
          proc<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
这个过程较长，实际上和 <span class="underline">简单表达式</span> 处理一样
</p>
</div>
</div>

<div id="outline-container-orgc6e0fc0" class="outline-4">
<h4 id="orgc6e0fc0">amb表达式</h4>
<div class="outline-text-4" id="text-orgc6e0fc0">
<p>
<span class="underline">amb</span> 的 <span class="underline">执行过程</span> 定义了一个循环 try-next，它周而复始地去做针对表达式所有可能值的执行过程：
</p>
<ul class="org-ul">
<li>对于每个执行过程的调用，都带有一个 <span class="underline">失败续延</span> ，这个失败续延会 <b>导致去试探下一个可能值</b></li>
<li>如果不再存在可能值时候，整个 <span class="underline">amb</span> 表达式失败</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-amb</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>cprocs <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">map</span> analyze <span style="color: #696969;">(</span>amb-choices exp<span style="color: #696969;">))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#20998;&#26512;&#21508;&#23376;&#34920;&#36798;&#24335;&#30340;&#25191;&#34892;&#36807;&#31243;</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span> 
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">try-next</span> choices<span style="color: #696969;">)</span> 
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? choices<span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span>fail<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#27809;&#26377;&#20219;&#20309;&#20540;&#21487;&#20197;&#35797;&#25506;&#30340;&#26102;&#20505;&#65292;&#25253;&#20986;&#22833;&#36133;</span>
            <span style="color: #696969;">((</span>car choices<span style="color: #696969;">)</span> env <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#35843;&#29992; "&#31532;&#19968;&#20010;&#21487;&#33021;&#20540;" &#30340;&#25191;&#34892;&#36807;&#31243;</span>
             succeed <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">(car choices) &#25104;&#21151;&#32493;&#24310;&#65306;&#21407;&#22987;&#30340;&#25104;&#21151;&#32493;&#24310;&#65292;&#23454;&#38469;&#19978;&#23601;&#26159; amb &#25191;&#34892;&#25104;&#21151;</span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">(car choices) &#22833;&#36133;&#32493;&#24310;&#65306;&#23581;&#35797;&#19979;&#19968;&#20010;&#21487;&#33021;&#20540;</span>
               <span style="color: #696969;">(</span>try-next <span style="color: #696969;">(</span>cdr choices<span style="color: #696969;">))))))</span>
      <span style="color: #696969;">(</span>try-next cprocs<span style="color: #696969;">))))</span>
</pre>
</div>
</div>
</div>
</div>
